Revit 2024 API
ReferenceArray.Append Method
Add the reference to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	Reference item
)
Visual Basic
Public Overridable Sub Append ( _
	item As Reference _
)
Visual C++
public:
virtual void Append(
	Reference^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Reference
The reference to be added.
See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace